{
  "architectures": [
    "Glm4MoeLiteForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "pad_token_id": 154820,
  "eos_token_id": [
    154820,
    154827,
    154829
  ],
  "hidden_act": "silu",
  "hidden_size": 256,
  "intermediate_size": 512,
  "max_position_embeddings": 202752,
  "model_type": "glm4_moe_lite",
  "moe_intermediate_size": 128,
  "topk_method": "noaux_tc",
  "norm_topk_prob": true,
  "num_attention_heads": 4,
  "n_group": 1,
  "topk_group": 1,
  "n_routed_experts": 8,
  "n_shared_experts": 1,
  "routed_scaling_factor": 1.8,
  "num_experts_per_tok": 2,
  "first_k_dense_replace": 1,
  "num_hidden_layers": 2,
  "num_key_value_heads": 4,
  "num_nextn_predict_layers": 1,
  "partial_rotary_factor": 1.0,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "tie_word_embeddings": false,
  "dtype": "bfloat16",
  "transformers_version": "5.0.0rc0",
  "q_lora_rank": 96,
  "kv_lora_rank": 64,
  "qk_nope_head_dim": 48,
  "qk_rope_head_dim": 16,
  "v_head_dim": 64,
  "vocab_size": 154880
}
